Revit 2024 API
BuiltInFailures.DuctFailures.CannotCreateGeometryForDuct Property
 Cannot create geometry for flex duct. The flex duct is intersecting itself or the start and end are too close together.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public static FailureDefinitionId CannotCreateGeometryForDuct { get; }
Visual Basic
Public Shared ReadOnly Property CannotCreateGeometryForDuct As FailureDefinitionId
	Get
Visual C++
public:
static property FailureDefinitionId^ CannotCreateGeometryForDuct {
	FailureDefinitionId^ get ();
}
See Also
BuiltInFailures.DuctFailures Class
Autodesk.Revit.DB Namespace